{
  "backend/main.mo": "Motoko canister managing user profiles with access control, storage mixins, and CRUD operations for authenticated principals.",
  "feature_evidence.json": "Feature evidence report linking a specific frontend dropdown update to impacted files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose in the app architecture.",
  "frontend/DEPLOYMENT_MAINNET.md": "Guide detailing prerequisites and steps to deploy PlayPal to the Internet Computer mainnet.",
  "frontend/index.css": "Tailwind base configuration defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry configuring meta tags, PWA manifest, iOS settings, and root mount point.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, colors, orientation, and icon assets.",
  "frontend/public/service-worker.js": "Service worker implementing cache versioning, precaching, cleanup, and network-first fetching.",
  "frontend/scripts/mainnet-redeploy.sh": "Bash script automating clean install, build, and mainnet deployment via dfx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile gating, and rendering the main app shell.",
  "frontend/src/components/AppShell.tsx": "App layout with bottom navigation and three-screen routing: Discover, Profile, and Settings.",
  "frontend/src/components/ChatMessageBubble.tsx": "Empty placeholder file for a chat message bubble component.",
  "frontend/src/components/DiscoverCard.tsx": "Displays a user profile card with photo, basic info, stats, and badges for position, zone, and availability.",
  "frontend/src/components/DiscoverFilters.tsx": "Provides category and zone filter controls for discovering profiles using select inputs.",
  "frontend/src/components/InlineScreenFallback.tsx": "Empty placeholder component file.",
  "frontend/src/components/InlineSheetErrorBoundary.tsx": "Empty placeholder component file.",
  "frontend/src/components/LevelStars.tsx": "Renders up to five stars based on a user level converted to a numeric score.",
  "frontend/src/components/ProfilePhotoUploader.tsx": "Handles photo uploads with validation, progress tracking, and integration with the backend upload mutation.",
  "frontend/src/components/StartupShell.tsx": "Empty placeholder component file.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user photo if available or a fallback icon with gradient background.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useMessageNotifications.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for profile operations, photo uploads, and discovering candidate profiles via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables and base styles for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React, wraps the app with query and identity providers, and loads global styles.",
  "frontend/src/screens/ChatScreen.tsx": "Empty placeholder screen file.",
  "frontend/src/screens/DiscoverScreen.tsx": "Implements the swipe-style discovery screen with filters, candidate navigation, and simple like/pass handling.",
  "frontend/src/screens/EditProfileScreen.tsx": "Form screen for editing the user's profile and submitting updates to the backend.",
  "frontend/src/screens/LoginScreen.tsx": "Login page using Internet Identity with branding, tagline, and login/create-account buttons.",
  "frontend/src/screens/MatchesScreen.tsx": "Empty placeholder file for a future matches screen.",
  "frontend/src/screens/MatchProfileScreen.tsx": "Empty placeholder file for a future match profile screen.",
  "frontend/src/screens/ProfileScreen.tsx": "Displays the user's profile with stats, bio, availability, and an option to edit or upload a photo.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Form for creating a new profile with fields for personal info, level, position, zone, and availability.",
  "frontend/src/screens/SettingsScreen.tsx": "Settings page supporting logout and displaying basic app information.",
  "frontend/src/utils/discoverFilterMappings.ts": "Exports category options used by the Discover filter UI.",
  "frontend/src/utils/profileMappings.ts": "Provides helpers for converting levels and positions to numbers or Spanish labels.",
  "frontend/src/utils/startupPerf.ts": "Empty utility file reserved for future startup performance logic.",
  "frontend/src/utils/unreadMessagesStore.ts": "Empty file intended for future unread messages state management.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from hash routing.",
  "frontend/src/utils/uruguayDepartments.ts": "Exports the full list of Uruguay departments and a constant for selecting all departments.",
  "frontend/src/utils/zoneFilterMappings.ts": "Empty placeholder for zone filter mapping utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, fonts, shadows, animations, and enabling plugins.",
  "project_state.json": "Project metadata tracking issues, feature requests, and scrollability requirements for the departments dropdown."
}