{
  "backend/main.mo": "Motoko backend defining profile, like, match, and chat models with comparison helpers plus profile creation logic and authorization/storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Flat JSON-style file summarizing all major frontend components, screens, hooks, and utilities.",
  "frontend/DEPLOYMENT_MAINNET.md": "Mainnet deployment guide detailing prerequisites and steps for building and deploying PlayPal.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme and base styles for light and dark modes.",
  "frontend/index.html": "Main HTML entry point with PWA configuration, meta tags, and script loader for the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and display settings.",
  "frontend/public/service-worker.js": "Production service worker implementing versioned caching, precache strategy, and network-first logic for API calls.",
  "frontend/scripts/mainnet-redeploy.sh": "Shell script that reinstalls deps, builds the frontend, verifies files, and redeploys canisters to mainnet.",
  "frontend/src/App.tsx": "Controls authentication flow, showing login, profile setup, loading, or the main app shell based on identity and user profile state.",
  "frontend/src/components/AppShell.tsx": "Manages navigation between main screens, handles chat and match profile transitions, and displays message notification badges.",
  "frontend/src/components/ChatMessageBubble.tsx": "Renders a single chat message with styling based on sender and displays its timestamp.",
  "frontend/src/components/DiscoverCard.tsx": "Displays a user's profile card with photo, level, details, availability, and stats.",
  "frontend/src/components/DiscoverFilters.tsx": "Provides UI controls for filtering discover results by level range and geographic zone.",
  "frontend/src/components/InlineSheetErrorBoundary.tsx": "Catches render errors in sheet content and shows a retry/close error UI instead of crashing the app.",
  "frontend/src/components/LevelStars.tsx": "Shows up to five stars representing a user's numeric level.",
  "frontend/src/components/ProfilePhotoUploader.tsx": "Handles profile photo selection, validation, upload, and progress display.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user photo if available or a fallback icon avatar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, initializing access control and invalidating queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and tracking login status.",
  "frontend/src/hooks/useMessageNotifications.ts": "Implements polling and local storage–based tracking of unread chat messages, showing notifications and sender info as needed.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, photos, matches, chat interactions, and candidate discovery using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light and dark theme CSS variables for UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/screens/ChatScreen.tsx": "Renders a chat interface with message fetching, sending, auto‑scrolling, and recipient profile display.",
  "frontend/src/screens/DiscoverScreen.tsx": "Displays swipe‑style candidate discovery with filters, liking/passing, and UI state management.",
  "frontend/src/screens/EditProfileScreen.tsx": "Form UI for editing an existing profile, handling state, validation, and submitting updates via useUpdateProfile.",
  "frontend/src/screens/LoginScreen.tsx": "Displays the login screen with branding and buttons to sign in or create an account using Internet Identity.",
  "frontend/src/screens/MatchesScreen.tsx": "Shows the user's matches list and loads each matched user's profile, allowing navigation to chat or profile detail.",
  "frontend/src/screens/MatchProfileScreen.tsx": "Loads and displays another user's profile with handling for loading, errors, and navigation back.",
  "frontend/src/screens/ProfileScreen.tsx": "Shows the logged‑in user's profile with stats and allows switching to an edit mode to update details.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Initial profile creation form that collects user info and submits it via useCreateProfile.",
  "frontend/src/screens/SettingsScreen.tsx": "Renders the settings screen with logout functionality and an about section, clearing identity and query cache on logout.",
  "frontend/src/utils/discoverFilterMappings.ts": "Provides conversions between Level enum values and stable string keys for use in UI filters.",
  "frontend/src/utils/profileMappings.ts": "Maps Level and Position enums to numbers or Spanish labels and back for profile handling.",
  "frontend/src/utils/unreadMessagesStore.ts": "Manages unread message state per user in localStorage, including loading, saving, and clearing.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters for routing and state handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing known issues, requested fixes, and feature definitions for resolving a white‑screen crash in Discover filters."
}