{
  "backend/main.mo": "Motoko backend defining profile, like, match, and chat types with comparison functions and CRUD logic using access control, blob storage, and in‑memory maps/sets.",
  "feature_evidence.json": "Feature evidence report linking a UI filter update to affected frontend files, components, and requirements.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/DEPLOYMENT_MAINNET.md": "Guide outlining prerequisites and steps for deploying the app to IC mainnet.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global styling.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, manifest links, and loading the React app root.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, colors, orientation, and icon assets for PlayPal.",
  "frontend/public/service-worker.js": "Service worker implementing versioned caching with precache, network-first for APIs, and cache-first for static assets.",
  "frontend/src/App.tsx": "Main React component that routes between login, profile setup, and the authenticated app shell based on identity and profile state.",
  "frontend/src/components/AppShell.tsx": "Manages navigation between main app screens, handling chat and match profile transitions with unread message logic.",
  "frontend/src/components/ChatMessageBubble.tsx": "Displays a chat message bubble with styling based on sender and formatted timestamp.",
  "frontend/src/components/DiscoverCard.tsx": "Renders a profile card with photo, stats, availability, and visual details for the Discover screen.",
  "frontend/src/components/DiscoverFilters.tsx": "Provides level and zone filter controls for the Discover screen using select inputs.",
  "frontend/src/components/LevelStars.tsx": "Shows a 1–5 star rating based on player level.",
  "frontend/src/components/ProfilePhotoUploader.tsx": "Handles image selection and upload with progress tracking and validation.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user's avatar image or a fallback icon if no image exists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity loading.",
  "frontend/src/hooks/useMessageNotifications.ts": "Hook that polls for new chat messages, tracks unread counts per sender, and syncs unread state with localStorage.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profile management, discovery, chat, and media upload using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme colors and global element defaults.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity, and renders the root application.",
  "frontend/src/screens/ChatScreen.tsx": "Chat UI displaying messages with a recipient, message sending logic, and profile header details.",
  "frontend/src/screens/DiscoverScreen.tsx": "Swipe-style discovery screen that filters candidates and allows liking or passing users.",
  "frontend/src/screens/EditProfileScreen.tsx": "Form screen for editing a user profile with fields for name, age, level, position, zone, availability, and bio.",
  "frontend/src/screens/LoginScreen.tsx": "Renders the login screen with branding, feature highlights, and buttons for logging in or creating an account using Internet Identity.",
  "frontend/src/screens/MatchesScreen.tsx": "Shows a list of matches for the logged-in user and loads each matched user's profile with actions to chat or view profile.",
  "frontend/src/screens/MatchProfileScreen.tsx": "Displays another user's profile with loading and error states, showing avatar, level, position, and other details with back navigation.",
  "frontend/src/screens/ProfileScreen.tsx": "Displays the logged-in user's profile with editing support, avatar management, stats, and personal details.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Provides a form for new users to enter profile details and submit them to create their account.",
  "frontend/src/screens/SettingsScreen.tsx": "Shows settings including logout functionality and basic app information.",
  "frontend/src/utils/profileMappings.ts": "Utility mappings for converting level and position enums to numbers and Spanish labels.",
  "frontend/src/utils/unreadMessagesStore.ts": "Manages unread message state per user by loading, saving, and clearing data from localStorage. Tracks timestamps, unique message keys, and unread counts by sender.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and removing them from the hash. Supports both query-based and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Metadata describing project state, features, and new requests, including a pending request to use Uruguay department dropdowns in filters."
}