{
  "backend/main.mo": "Motoko canister implementing user profile creation, update, retrieval, and authorization using AccessControl and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Plain-text mapping of frontend file paths to short functional descriptions for build planning.",
  "frontend/DEPLOYMENT_MAINNET.md": "Guide describing prerequisites and steps for deploying PlayPal to IC mainnet.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables for light and dark mode.",
  "frontend/index.html": "Main HTML entry point with PWA metadata, manifest, and PlayPal branding.",
  "frontend/public/manifest.json": "PWA manifest defining PlayPal name, icons, theme colors, and metadata.",
  "frontend/public/service-worker.js": "Service worker implementing caching, versioning, precaching, and network-first fetch strategy.",
  "frontend/scripts/mainnet-redeploy.sh": "Bash script automating clean install, build, and mainnet deployment steps.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile gating, and rendering login, setup, or main app shell.",
  "frontend/src/components/AppShell.tsx": "Provides main app layout with screen switching and a bottom navigation bar.",
  "frontend/src/components/ChatMessageBubble.tsx": "Empty file.",
  "frontend/src/components/DiscoverCard.tsx": "Displays a profile card with photo, stats, badges, and availability info.",
  "frontend/src/components/DiscoverFilters.tsx": "Renders select inputs to filter discovery results by category and zone.",
  "frontend/src/components/InlineScreenFallback.tsx": "Empty file.",
  "frontend/src/components/InlineSheetErrorBoundary.tsx": "Empty file.",
  "frontend/src/components/LevelStars.tsx": "Shows a 1–5 star rating based on the user's level.",
  "frontend/src/components/ProfilePhotoUploader.tsx": "Handles image selection and upload with progress tracking for profile photos.",
  "frontend/src/components/StartupShell.tsx": "Empty file.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user photo or a fallback icon if none exists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useMessageNotifications.ts": "Empty file.",
  "frontend/src/hooks/useQueries.ts": "Contains react-query hooks for profiles, photo uploads, and discovery candidates.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers.",
  "frontend/src/screens/ChatScreen.tsx": "Empty file.",
  "frontend/src/screens/DiscoverScreen.tsx": "Swipe-style candidate discovery screen with local filters, card navigation, and like/pass handling.",
  "frontend/src/screens/EditProfileScreen.tsx": "Form UI to edit an existing user profile and submit updates via mutation.",
  "frontend/src/screens/LoginScreen.tsx": "Login screen using Internet Identity with branding, tagline, and UI buttons for login or account creation.",
  "frontend/src/screens/MatchesScreen.tsx": "Empty placeholder file for matches screen.",
  "frontend/src/screens/MatchProfileScreen.tsx": "Empty placeholder file for match profile screen.",
  "frontend/src/screens/ProfileScreen.tsx": "Displays the user's profile with stats, photo, and an option to switch to edit mode.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Initial profile creation form collecting user details and submitting them to the backend.",
  "frontend/src/screens/SettingsScreen.tsx": "Settings page providing logout functionality and basic app information.",
  "frontend/src/utils/discoverFilterMappings.ts": "Defines static category options for min/max discovery filters.",
  "frontend/src/utils/profileMappings.ts": "Utility functions to map levels and positions to numeric or Spanish-language equivalents.",
  "frontend/src/utils/startupPerf.ts": "Empty placeholder for startup performance utilities.",
  "frontend/src/utils/unreadMessagesStore.ts": "Empty placeholder for unread messages store.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and sessionStorage parameters, including support for hash-based routing.",
  "frontend/src/utils/uruguayDepartments.ts": "Exports a fixed list of Uruguay departments plus an 'all departments' label for zone filtering.",
  "frontend/src/utils/zoneFilterMappings.ts": "Empty file placeholder for zone filter mappings.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for styling.",
  "project_state.json": "Metadata describing project state, features, and pending requests for updating Discover filter UI."
}