{
  "backend/main.mo": "Defines profile, like, match, and chat data types with comparison logic, manages profiles, likes, matches, chat messages, and enforces authorization and storage via mixins.",
  "feature_evidence.json": "Empty feature evidence report container.",
  "frontend-file-summaries.txt": "Lists concise descriptions of all frontend components, hooks, screens, utilities, and configuration files.",
  "frontend/DEPLOYMENT_MAINNET.md": "Mainnet deployment guide describing prerequisites and steps for deploying PadelMatch to IC.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme definitions for light and dark modes.",
  "frontend/index.html": "HTML entrypoint with PWA meta tags, manifest, icons, and PlayPal branding.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, colors, display mode, and logo assets.",
  "frontend/public/service-worker.js": "Service worker implementing versioned caching with install, activate, and fetch handlers using mixed network/cache strategies.",
  "frontend/src/App.tsx": "Main React entry deciding between login, profile setup, or authenticated app shell based on identity and profile state.",
  "frontend/src/components/AppShell.tsx": "Authenticated app container providing navigation, screen state, chat handling, and unread message badges.",
  "frontend/src/components/ChatMessageBubble.tsx": "Renders a chat message bubble with styling based on message ownership and displays formatted timestamp.",
  "frontend/src/components/DiscoverCard.tsx": "Displays a user profile card with avatar, name, level, badges, bio, availability, and match stats.",
  "frontend/src/components/DiscoverFilters.tsx": "Provides UI controls to filter profiles by minimum level, maximum level, and zone.",
  "frontend/src/components/LevelStars.tsx": "Shows up to five star icons filled according to a player's level.",
  "frontend/src/components/ProfilePhotoUploader.tsx": "Handles image file selection and uploads profile photos with progress tracking and validation.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user's photo or a fallback icon with gradient background.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context for Internet Identity, managing login, stored identities, and status.",
  "frontend/src/hooks/useMessageNotifications.ts": "Polls for new chat messages, tracks unread counts per sender, caches sender names, and manages read state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, photos, discovery, likes, chat, and related mutations tied to an actor API.",
  "frontend/src/index.css": "Tailwind CSS setup with light/dark theme CSS variables and global styles.",
  "frontend/src/main.tsx": "Initializes React root, wraps the app with query and Internet Identity providers, and loads global styles.",
  "frontend/src/screens/ChatScreen.tsx": "Chat UI screen that loads messages, displays recipient profile, and sends new chat messages.",
  "frontend/src/screens/DiscoverScreen.tsx": "User discovery screen with swipe-like candidate browsing, filters, and like/pass actions.",
  "frontend/src/screens/EditProfileScreen.tsx": "Form screen for editing a user profile and submitting updates via mutation.",
  "frontend/src/screens/LoginScreen.tsx": "Login screen prompting the user to authenticate using Internet Identity with branding and UI elements.",
  "frontend/src/screens/MatchesScreen.tsx": "Shows the user's match list and renders match cards that load each match's profile with chat and profile actions.",
  "frontend/src/screens/MatchProfileScreen.tsx": "Displays a detailed view of another user's profile with loading, error, and not-found states.",
  "frontend/src/screens/ProfileScreen.tsx": "Displays the logged-in user's profile with editing support, photo upload, stats, and availability info.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Form for creating a new user profile including basic info, level, position, availability, and bio.",
  "frontend/src/screens/SettingsScreen.tsx": "Provides account settings including logout and app info sections.",
  "frontend/src/utils/profileMappings.ts": "Maps profile enums to numbers or Spanish labels for display.",
  "frontend/src/utils/unreadMessagesStore.ts": "Manages localStorage-based state for unread messages keyed by user principal.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear stored or hash-based values.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, typography, animations, and container settings with custom plugins and themes.",
  "project_state.json": "Defines the PlayPal project state, including logo requirements, deployment issues, and pending feature requests for restoring and replacing the logo."
}