{
  "backend/main.mo": "Defines profile, like, match, and chat data types with comparison helpers and provides authenticated CRUD operations using access control and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries linking features to source files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend source files for reference or tooling.",
  "frontend/DEPLOYMENT_MAINNET.md": "Mainnet deployment guide describing prerequisites and steps for building and deploying PlayPal.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining the app's light/dark theme tokens.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, iOS settings, and root mount point.",
  "frontend/public/manifest.json": "PWA manifest defining app name, theming, start URL, and icon assets.",
  "frontend/public/service-worker.js": "Service worker implementing versioned cache management and network-first or cache-first strategies.",
  "frontend/scripts/mainnet-redeploy.sh": "Shell script automating clean install, build, checks, and mainnet deployment via dfx.",
  "frontend/src/App.tsx": "Main app entry that handles identity initialization, user profile checks, startup performance markers, and routes between login, setup, or main app shell.",
  "frontend/src/components/AppShell.tsx": "Core navigation container that switches between screens, manages chat and profile views, and lazily loads secondary screens.",
  "frontend/src/components/ChatMessageBubble.tsx": "Displays a chat message bubble with styling based on sender and formatted timestamp.",
  "frontend/src/components/DiscoverCard.tsx": "Shows a detailed profile card with avatar, bio, stats, and metadata for discovery browsing.",
  "frontend/src/components/DiscoverFilters.tsx": "Renders level and zone filter controls for discovery search using select components.",
  "frontend/src/components/InlineScreenFallback.tsx": "Simple inline loading fallback with a spinner and message.",
  "frontend/src/components/InlineSheetErrorBoundary.tsx": "Error boundary for sheet content that shows a retry/close UI instead of crashing the app.",
  "frontend/src/components/LevelStars.tsx": "Displays a 1–5 star rating based on player level.",
  "frontend/src/components/ProfilePhotoUploader.tsx": "Handles image selection and upload with validation, progress tracking, and error toasts.",
  "frontend/src/components/StartupShell.tsx": "Lightweight skeleton UI shown during initial identity and app loading.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user photo or a placeholder icon if none exists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, stored identity loading, and status flags.",
  "frontend/src/hooks/useMessageNotifications.ts": "Implements polling, unread tracking, sender-name caching, and notifications for new chat messages tied to the authenticated user.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query for profiles, matches, chat messages, likes, and uploads, providing caching and mutation helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, including color tokens and global element styling.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with React Query and Internet Identity providers.",
  "frontend/src/screens/ChatScreen.tsx": "Renders a chat interface with message list, profile header, sending capability, and auto-scroll behavior.",
  "frontend/src/screens/DiscoverScreen.tsx": "Displays a swipe-style discovery screen with filters, candidate navigation, and like/pass interactions.",
  "frontend/src/screens/EditProfileScreen.tsx": "Form-based screen allowing users to edit and submit profile fields, updating via a mutation hook before returning to the previous screen.",
  "frontend/src/screens/LoginScreen.tsx": "Login UI that triggers Internet Identity authentication with branding, tagline, and loading states.",
  "frontend/src/screens/MatchesScreen.tsx": "Fetches and lists user matches, showing loading and empty states and linking each match to chat or profile views.",
  "frontend/src/screens/MatchProfileScreen.tsx": "Displays another user’s profile with loading, error, and empty states, allowing navigation back and refetching on error.",
  "frontend/src/screens/ProfileScreen.tsx": "Shows the logged-in user's profile with stats, photo, and details, and allows switching to an edit mode.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Initial profile creation form collecting user details and submitting them via a create-profile mutation.",
  "frontend/src/screens/SettingsScreen.tsx": "Settings screen with account logout flow, confirmation dialog, and about section.",
  "frontend/src/utils/discoverFilterMappings.ts": "Maps Level enum values to UI string keys and back for filter components.",
  "frontend/src/utils/profileMappings.ts": "Converts Level and Position enums to numbers or Spanish labels and back.",
  "frontend/src/utils/startupPerf.ts": "Dev‑only startup performance logger that records marks and reports timings.",
  "frontend/src/utils/unreadMessagesStore.ts": "Loads, saves, and clears unread message state per user using localStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers to read, persist, and clear URL and session parameters, including hash parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing performance issues, existing features, and pending requests."
}