{
  "backend/main.mo": "Motoko canister defining profiles, likes, matches, chat messages, filters, and related comparison logic, plus CRUD-like operations with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report linking a frontend reliability fix to specific files, components, and tests with high confidence.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all major frontend files involved in the PadelMatch app.",
  "frontend/DEPLOYMENT_MAINNET.md": "Mainnet deployment guide explaining prerequisites and steps for deploying the app on IC.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point with PWA configuration, meta tags, and notes for production service worker/manifest setup.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theming, icons, and display mode for PadelMatch.",
  "frontend/public/service-worker.js": "Versioned production service worker implementing precaching, cache cleanup, and network-first/static cache-first fetch strategies.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile loading, and conditional routing to login, setup, or main app shell.",
  "frontend/src/components/AppShell.tsx": "Main app layout managing screen navigation and chat state, rendering screens and a bottom navigation bar.",
  "frontend/src/components/ChatMessageBubble.tsx": "Renders a message bubble with styling based on sender and formatted timestamp.",
  "frontend/src/components/DiscoverCard.tsx": "Displays a detailed profile card with photo, stats, level, tags, and bio for discovery.",
  "frontend/src/components/DiscoverFilters.tsx": "Provides UI controls to filter discovery results by level range and zone.",
  "frontend/src/components/LevelStars.tsx": "Shows up to five stars based on a user's level using mapped numeric values.",
  "frontend/src/components/ProfilePhotoUploader.tsx": "Handles image selection and upload with size/type validation and progress tracking.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user's photo if available or a placeholder avatar if not.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context for Internet Identity, managing login, stored identities, and status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, photos, discovery, and interactions using the backend actor.",
  "frontend/src/index.css": "Global Tailwind setup defining light and dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, Internet Identity provider, and loads global styles.",
  "frontend/src/screens/ChatScreen.tsx": "Chat UI that loads messages and recipient profile, handles sending messages, and displays a scrollable chat view.",
  "frontend/src/screens/DiscoverScreen.tsx": "Candidate discovery screen with filters, swipe-like like/pass actions, and dynamic candidate loading.",
  "frontend/src/screens/EditProfileScreen.tsx": "Form for editing user profile fields and submitting updates through a mutation.",
  "frontend/src/screens/LoginScreen.tsx": "Login screen using Internet Identity with branding, tagline, and login button.",
  "frontend/src/screens/MatchesScreen.tsx": "Displays user matches and loads profile cards, allowing navigation to chat for each match.",
  "frontend/src/screens/ProfileScreen.tsx": "User profile screen that loads the caller's profile, displays details with edit and photo upload options, and shows an edit form when toggled.",
  "frontend/src/screens/ProfileSetupScreen.tsx": "Profile creation form that collects user info and submits it via useCreateProfile, including availability parsing and basic validation.",
  "frontend/src/screens/SettingsScreen.tsx": "Settings page providing logout functionality via Internet Identity and showing basic app info.",
  "frontend/src/utils/profileMappings.ts": "Utility functions converting between Level enums and numbers plus mapping Position enums to Spanish labels.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query strings.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current issues, features, and a pending request related to profile visibility for matched users."
}