{
  "kind": "build_request",
  "title": "Replace zone text input with selectable Uruguay departments in Discover filters",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the discovery filters UI so the \"Zona\" filter is a dropdown (select) containing all departments of Uruguay as selectable options, instead of a free-text input.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "En los filtros, añadi en zonas, cada departamento de Uruguay como seleccionable en lugar de tener que escribirlo"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/DiscoverFilters.tsx, the \"Zona\" field is no longer a text <Input>; it uses the existing Select/SelectItem components.",
        "The zone dropdown includes exactly these Uruguay departments as options: Artigas, Canelones, Cerro Largo, Colonia, Durazno, Flores, Florida, Lavalleja, Maldonado, Montevideo, Paysandú, Río Negro, Rivera, Rocha, Salto, San José, Soriano, Tacuarembó, Treinta y Tres.",
        "Selecting a department updates filters.zone via onFiltersChange with the selected department name as a string.",
        "There is a clear way to represent 'no zone filter' (e.g., an \"All\" / \"Any\" option) that sets filters.zone to an empty string so existing filtering logic continues to work.",
        "DiscoverScreen continues to pass the same filters object shape to useDiscoverCandidates without any backend changes required."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Do not introduce any new backend canisters/services; keep the existing single-actor Motoko backend unchanged unless strictly required by the filter behavior."
  ],
  "nonGoals": [
    "Translating the app UI language.",
    "Adding city/neighborhood-level zones beyond Uruguay departments.",
    "Changing discovery matching/filtering semantics on the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}