{
  "kind": "build_request",
  "title": "Fix white screen crash when tapping the Discover 'FILTROS' button",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the runtime crash that causes a blank/white screen when the user taps the \"FILTROS\" button in the Discover screen, so the filters sheet opens reliably and renders the filter controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "TOCO EL BOTON FILTROS Y SE PONE LA PANTALLA EN BLANCO"
        ]
      },
      "acceptanceCriteria": [
        "From the Discover screen, tapping the \"FILTROS\" button opens the sheet and the app does not render a blank/white screen.",
        "No uncaught exceptions are thrown when opening the sheet (check browser console).",
        "The sheet renders the three filter controls (minimum level, maximum level, zone) without errors."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Discover filters UI implementation to ensure Shadcn Select components use stable string values (and not candid/IDL enum/variant objects) for their `value` / `SelectItem value` props, while still producing a valid `Filters` object for `useDiscoverCandidates(filters)`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "TOCO EL BOTON FILTROS Y SE PONE LA PANTALLA EN BLANCO"
        ]
      },
      "acceptanceCriteria": [
        "Opening the filters sheet does not crash even if `Level` is represented as a non-string candid/IDL type at runtime.",
        "Selecting \"Minimum level\" and \"Maximum level\" updates the Discover screen results (query refresh) without errors.",
        "All Selects show the currently selected value correctly after changes and after closing/reopening the sheet."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a minimal, user-safe failure mode for the Discover filters panel rendering: if the filters UI throws during render, show a small inline error state inside the sheet instead of blanking the entire app view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "TOCO EL BOTON FILTROS Y SE PONE LA PANTALLA EN BLANCO"
        ]
      },
      "acceptanceCriteria": [
        "If an error occurs while rendering the filters panel, the rest of the Discover screen remains visible and interactive.",
        "The sheet content shows an inline error message and a way to close the sheet (so the user can recover without refresh)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing Shadcn components instead).",
    "Do not edit any frontend immutable paths listed in SYSTEM_CONTEXT (e.g., useInternetIdentity/useActor/main.tsx).",
    "Keep the backend architecture unchanged (single Motoko actor); this fix should be frontend-only unless proven otherwise."
  ],
  "nonGoals": [
    "Adding new filter fields beyond minimum level, maximum level, and zone.",
    "Changing app navigation, authentication, or backend discovery logic.",
    "Translating existing Spanish UI strings to English (only the build request text must be in English)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}